english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* live
:PROPERTIES:
:EXPORT_FILE_NAME: live.md
:END:
活着但住的不好
** 语义
*** 住
They lived in Holland for ten years.
*** 生长
These particular birds live on only one island in the Pacific.
*** 生活
He lived in the eighteenth century.
*** 活着
Whithout light, plants couldn't live.
*** 过...生活
The people in this country just want to live in peace.
*** 靠...为生
Fishing is the way their families have lived for generations.
*** 享受生活
She wanted to get out and live a little.
*** 放置
Those big dishes live in the cupboard next to the fridge.
*** 流传下去
His name will live forever.
*** 活的
Protesters want to stop the export of live shee and cattle.
*** 现场直播的
There will be live TV coverge of tonight's big match.
*** 现场表演的
A lot of the bars have live music.
*** 通电的
Be careful - those wires are live.
*** 会爆炸的
They came across a field of live, unexploded mines.
*** 真的
Troops fires live ammunition to disperse the crowd.
*** 当前所关心的
Drink-driving is still very much a live issue.
*** 在现场直播
The match will be shown live by the BBC.
*** 现场演出
I love their music, but I've never seen them perform live.
** 短语
*** [#C] live rough
I ran away from home and lived rough for nine months.

https://youglish.com/getbyid/77180792/live%20rough/english
*** live to
My grandmother lived to 85.

https://youglish.com/getbyid/129669567/live%20to/english
*** live by
I have always tried to live by my faith.

https://youglish.com/getbyid/101051275/live%20by/english
*** live through
She lived through her children's lives.

https://youglish.com/getbyid/89326591/live%20through/english
*** [#C] living quarters
the White House living quarters

https://youglish.com/getbyid/128779852/living%20quarters/english
*** [#C] living expenses
His tuition is paid, but he'll work to cover his living expenses.

https://youglish.com/getbyid/153192140/living%20expenses/english
*** [#C] living arrangements
Her mother disapproved of the living arrangements, saying that two girls living with four boys was bound to cause problems.

https://youglish.com/getbyid/69527792/living%20arrangements/english
*** live it up
Sam was living it up in London.

https://youglish.com/getbyid/162108560/live%20it%20up/english
*** [#C] live a lie
I knew that I could not continue to live a lie.

https://youglish.com/getbyid/4930506/live%20a%20lie/english
*** be living on borrowed time
She's been living on borrowed time for the last year.

https://youglish.com/getbyid/75633934/living%20on%20borrowed%20time/english
*** live and breathe
Politics is the stuff I live and breathe.

https://youglish.com/getbyid/1497999/live%20and%20breathe/english
*** you haven't lived
You haven't lived until you've tasted champagne.

https://youglish.com/getbyid/13370082/you%20haven't%20lived/english
*** somebody will live to regret it
If you marry him, you'll live to regret it.
*** live to fight another day
Hopfully, the company will live to fight another day.

https://youglish.com/getbyid/99997850/live%20to%20fight%20another%20day/english
*** live life to the full
She believes in living life to the full.

https://youglish.com/getbyid/116210325/live%20life%20to%20the%20full/english
*** live high on the hog
*** [#C] live from hand to mouth
We lived from hand to mouth, never knowing where the next meal was coming from.

https://youglish.com/getbyid/2414230/live%20from%20hand%20to%20mouth/english
*** long live free
Long live free education!

https://youglish.com/getbyid/19279132/long%20live%20free/english
*** live coals
She threw the paper onto the live coals.
*** go live
Their new information retrieval system went live last month.

https://youglish.com/getbyid/77610992/go%20live/english
